Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: ཁམས་གསུམ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པས་འཇིགས་པའི་ཕྱིར་འདུ་བྱེད་ཐམས་ཅད་ལ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བར་སོ་སོར་རྟོག་པའི་སེམས་རིན་པོ་ཆེ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བདག་མེད་པས་ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་སོ་སོར་རྟོག་པའི་སེམས་རིན་པོ་ཆེ་དང་། འདོད་པའི་ཁམས་ལས་ཤིན་ཏུ་འདའ་བས་མི་གཙང་བར་སོ་སོར་རྟོག་པའི་སེམས་རིན་པོ་ཆེ་དང་། ཤིན་ཏུ་ཞི་ཞིང་ཉེ་བར་ཞི་བས་མྱ་ངན་ལས་འདས་པ་ལ་ཞི་བར་སོ་སོར་རྟོག་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (68) the precious attitude of discerning that all formations are impermanent and suffering because one fears being attached to the three realms, (69) the precious attitude of discerning that all phenomena are selfless because all sentient beings are selfless, (70) the precious attitude of discerning the desire realm to be impure because one has transcended it, (71) the precious attitude of discerning that nirvāṇa is peace since it is calm and tranquil,

source: བདུད་རྩིའི་སྒོ་ལ་ཡང་དག་པར་གཞོལ་བས་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་མོས་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (72) the precious attitude of trusting in the gateways to liberation—emptiness, the absence of marks, and the absence of wishes—because of dedicating oneself to the gateway of deathlessness,

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པས་ཆོས་ཐམས་ཅད་ལ་མ་སྐྱེས་པ་དང་མ་བྱུང་བས་མོས་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (73) the precious attitude of trusting in the unborn and nonarisen nature of all phenomena because one has gained acceptance of the unborn nature of phenomena,

source: ལྟ་བ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པས་ཆོས་ཐམས་ཅད་ལ་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་དང་། མིག་ཡོར་དང་། རྨི་ལམ་ལྟ་བུར་ཡང་དག་པར་གཞོལ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (74) the precious attitude of perceiving all phenomena to be like illusions, mirages, reflections of the moon in water, optical illusions, and dreams because one does not cling to any views,

source: རྟག་པ་དང་ཆད་པ་དང་བྲལ་བས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་འཐུན་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (75) the precious attitude of being in accord with dependent origination because of being free from the views of eternalism and nihilism,

source: གཉིས་དང་བྲལ་བས་མཐར་ལྟ་བ་ཐམས་ཅད་སེལ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (76) the precious attitude of eliminating all extreme views because of being free from duality,

source: ཐེག་པ་གཅིག་ཏུ་ཁོང་དུ་ཆུད་པས་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (77) the precious attitude of entering the Dharma gateway of nonduality because of understanding the single vehicle,

source: སྐྱོན་མེད་པ་ལ་འཇུག་པས་སྤྱོད་པ་ཐམས་ཅད་ལས་ལྡོག་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (78) the precious attitude of turning away from all forms of conduct because one enters faultlessness,

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་ཡང་དག་པར་སྐྱོན་མེད་པ་ལ་སོ་སོར་རྟོག་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (79) the precious attitude of discerning that all phenomena are truly beyond faults since they are sameness, and

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྒྲུབ་པའི་སེམས་རིན་པོ་ཆེ་སྟེ།
en: (80) the precious attitude of accomplishing all the factors of awakening, since all buddha qualities are unborn.

source: འདི་དག་ནི་ཆོས་རིན་པོ་ཆེ་བརྒྱད་ཅུའོ། །
en: Those are the eighty precious qualities.

source: མིའམ་ཅིའི་བདག་པོ་དེ་ལྟར་གང་ཆོས་བརྒྱད་ཅུ་པོ་འདི་ལ་འཇུག་པ་དང་ཐོབ་པ་དང་། ནན་ཏན་བྱེད་པ་དེ་ནི་དཀོན་མཆོག་འབྱུང་གནས་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། །
en: “Lord of the kiṃnaras, engaging in those eighty attitudes, developing them, and persevering in them is known as the absorption of the source of wealth .

source: ཆོས་འདི་དག་ནི་ཏིང་ངེ་འཛིན་སྒྲུབ་པའོ། །
en: Those attitudes constitute the practice of that absorption.

source: བྱང་ཆུབ་སེམས་དཔས་གང་གི་ཚེ་དཀོན་མཆོག་འབྱུང་གནས་ཏིང་ངེ་འཛིན་འདི་རབ་ཏུ་ཐོབ་པར་གྱུར་པ་དེའི་ཚེ། དེས་གང་ལ་དབང་ཐོབ་པར་མ་གྱུར་པའི་རིན་པོ་ཆེའི་འཇིག་རྟེན་གྱིའམ། འཇིག་རྟེན་ལས་འདས་པ་དེ་གང་ཡང་མེད་དོ། །
en: Once bodhisattvas achieve this absorption of the source of wealth , there is no mundane or supramundane wealth that they do not gain control over.

source: མིའམ་ཅིའི་བདག་པོ་དེ་ལ་འཇིག་རྟེན་གྱི་རིན་པོ་ཆེ་ནི་གང་། འཇིག་རྟེན་ལས་འདས་པའི་རིན་པོ་ཆེ་ནི་གང་ཞེ་ན།
en: Lord of the kiṃnaras, what is meant by mundane and supramundane wealth?

source: མིའམ་ཅིའི་བདག་པོ་དེ་ལ་འཇིག་རྟེན་གྱི་རིན་པོ་ཆེ་ནི་འདི་ལྟ་སྟེ། ལྷ་དང་མི་རྣམས་ཀྱི་ཆེ་བ་ཉིད་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པའི་ཆེ་བ་ཉིད་དང་། འཇིག་རྟེན་སྐྱོང་བའི་ཆེ་བ་ཉིད་དང་། འཁོར་ལོས་སྒྱུར་བའི་ཆེ་བ་ཉིད་དང་། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་ཆེ་བ་ཉིད་དོ། །
en: “Lord of the kiṃnaras, mundane wealth refers to the greatness of gods and humans, such as that of Śakra, Brahmā, the protectors of the world, universal monarchs, merchants, householders, and brahmins and kṣatriyas that are like great sāl trees.

source: དེ་དེ་ལྟར་ལྷ་དང་མི་རྣམས་ཀྱི་ཆེ་བ་ཉིད་རབ་ཏུ་ཐོབ་ཀྱང་རྒྱགས་པ་མི་སྐྱེད། བག་མེད་པ་མི་སྐྱེད་དོ། །
en: Although the bodhisattvas achieve the greatness of gods and humans, they do not become excited or careless.

source: དེ་བག་ཡོད་པར་གྱུར་པས། བྱང་ཆུབ་སྒྲུབ་པར་བྱེད་པའི་ཆོས་རྣམས་ཡང་དག་པར་བསྒྲུབ་པ་སྟེ།
en: Instead, they remain careful and so they accomplish the qualities that lead to awakening.

source: འདི་ནི་འཇིག་རྟེན་གྱི་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: This is what is meant by mundane wealth.

source: དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་རིན་པོ་ཆེ་གང་ཞེ་ན།
en: “What is meant by supramundane wealth?

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རིན་པོ་ཆེའོ། །
en: It is the precious Dharma that transcends the world.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རིན་པོ་ཆེ་གང་ཞེ་ན།
en: What is the precious Dharma that transcends the world?

source: ཆོས་གང་འཇིག་རྟེན་ལས་སྒྲོལ་བའོ། །
en: It is the Dharma that liberates from the world.

source: འཇིག་རྟེན་ལས་སྒྲོལ་བའི་ཆོས་གང་ཞེ་ན།
en: What is the Dharma that liberates from the world?

source: འཕགས་པ་འཇིག་རྟེན་ལས་འདས་པའི་ཤེས་རབ་སྟེ། ཤེས་རབ་ཀྱི་འཇིག་རྟེན་ལས་སྒྲོལ་ལོ། །
en: It is the noble supramundane insight—the insight that liberates from the world.

source: ཤེས་རབ་རིན་པོ་ཆེས་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་བསྡུས་ཏེ། ཤེས་རབ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ཡིན་ནོ། །
en: This precious insight subsumes all qualities that transcend the world; it is the most important among all supramundane qualities.

source: མིའམ་ཅིའི་བདག་པོ་འདི་ལྟ་སྟེ་དཔེར་ན་ཀླུང་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ནི་རྒྱ་མཚོ་ཆེན་པོའོ། །
en: For example, lord of the kiṃnaras, the most important body of water is the great ocean,

source: རི་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ནི་རིའི་རྒྱལ་པོ་རི་རབ་བོ། །
en: the most important mountain is the majestic Mount Sumeru,

source: སྐར་མ་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ནི་ཟླ་བའོ། །
en: the most important celestial body is the moon,

source: སྣང་བ་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ནི་ཉི་མའོ། །
en: the most important source of light is the sun,

source: རི་དགས་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ནི་སེང་གེའོ། །
en: the most important wild animal is the lion,

source: སྐྱེ་དགུ་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ནི་རྒྱལ་པོའོ། །
en: the most important person is the king,

source: སུམ་ཅུ་རྩ་གསུམ་པ་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ནི་བརྒྱ་བྱིན་ནོ། །
en: the most important god in the Heaven of the Thirty-Three is Śakra, and

source: ཚངས་པ་ལ་དབང་དུ་བྱ་བ་རྣམས་ཀྱི་གཙོ་བོ་ནི་ཚངས་པ་ཆེན་པོའོ། །
en: the most important being within the Brahmā realms is the Great Brahmā.

source: མིའམ་ཅིའི་བདག་པོ་དེ་བཞིན་དུ་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ནི་ཤེས་རབ་སྟེ། དེའི་ཕྱིར་ཤེས་རབ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Similarly, lord of the kiṃnaras, the most important of all supramundane qualities is insight, and it is therefore referred to as the king of all qualities.

source: མུ་སྟེགས་ལ་གནས་པ་བསྒྲལ་བའི་ཕྱིར་བདེ་བར་འགྲོ་བས་ལམ་མོ། །
en: “Insight is the path that frees from non-Buddhist views and thus leads to happy states of existence.

source: ཉོན་མོངས་པའི་མུན་པ་སེལ་བའི་ཕྱིར་སྒྲོན་མའོ། །
en: It is the lamp that clears away the darkness of afflictions, [the hero that brings victory in battle, the doctor that dispenses medicine, the teacher that imparts the knowledge of all sciences, the arrow that pierces all phenomena, the sword that severs all afflictions, and the plough that cuts through the thicket of the afflictions.]

source: གཡུལ་ལས་རྒྱལ་བའི་ཕྱིར་དཔའ་བོའོ། །
en: It is [the lamp that clears away the darkness of afflictions, ]the hero that brings victory in battle, [the doctor that dispenses medicine, the teacher that imparts the knowledge of all sciences, the arrow that pierces all phenomena, the sword that severs all afflictions, and the plough that cuts through the thicket of the afflictions.]

source: སྨན་རབ་ཏུ་སྦྱོར་བའི་ཕྱིར་སྨན་པའོ། །
en: It is [the lamp that clears away the darkness of afflictions, the hero that brings victory in battle, ]the doctor that dispenses medicine, [the teacher that imparts the knowledge of all sciences, the arrow that pierces all phenomena, the sword that severs all afflictions, and the plough that cuts through the thicket of the afflictions.]

source: གཙུག་ལག་ཐམས་ཅད་ཤེས་པའི་ཕྱིར་སློབ་དཔོན་ནོ། །
en: It is [the lamp that clears away the darkness of afflictions, the hero that brings victory in battle, the doctor that dispenses medicine, ]the teacher that imparts the knowledge of all sciences, the arrow that pierces all phenomena, [the sword that severs all afflictions, and the plough that cuts through the thicket of the afflictions.]

source: ཆོས་ཐམས་ཅད་ཕིགས་པའི་ཕྱིར་མདའོ། །
en: It is [the lamp that clears away the darkness of afflictions, the hero that brings victory in battle, the doctor that dispenses medicine, the teacher that imparts the knowledge of all sciences, ]the arrow that pierces all phenomena, [the sword that severs all afflictions, and the plough that cuts through the thicket of the afflictions.]

source: ཉོན་མོངས་པ་གཅོད་པའི་ཕྱིར་རལ་གྲིའོ། །
en: It is [the lamp that clears away the darkness of afflictions, the hero that brings victory in battle, the doctor that dispenses medicine, the teacher that imparts the knowledge of all sciences, the arrow that pierces all phenomena, ]the sword that severs all afflictions, and [the plough that cuts through the thicket of the afflictions.]

source: ཉོན་མོངས་པའི་ཚང་ཚིང་དྲལ་བའི་ཕྱིར་ཐོང་གཤོལ་ལོ། །
en: It is [the lamp that clears away the darkness of afflictions, the hero that brings victory in battle, the doctor that dispenses medicine, the teacher that imparts the knowledge of all sciences, the arrow that pierces all phenomena, the sword that severs all afflictions, and ]the plough that cuts through the thicket of the afflictions.

source: མཉམ་པའི་ཕྱིར་མི་འགལ་བའོ། །
en: Since it is sameness, it is beyond contradiction.

source: འཐབ་པ་མེད་པའི་ཕྱིར་རྩོད་པ་མེད་པའོ། །
en: Since it pacifies conflict, it is beyond dispute.

source: འབྱུང་བ་མེད་པའི་ཕྱིར་མི་འགག་པའོ། །
en: Since it is beyond arising, it is beyond cessation.

source: བདེན་པའི་དོན་རྣམས་ཡོངས་སུ་ཤེས་པའི་མཐར་ཐུག་པའི་ཕྱིར་མི་འཁྲུགས་པའོ། །
en: Since it is the ultimate understanding of the true meaning, it is undisturbed.

source: དྲན་པ་ཉེ་བར་གཞོག་པའི་ཕྱིར་དྲན་པའོ། །
en: Since it employs mindfulness, it remembers.

source: ཡང་དག་པར་སྤོང་བ་རྣམས་ལ་མཉམ་པ་ཉིད་དོ། །
en: It sees the sameness of the true relinquishments.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་བསྐྱེད་པའོ། །
en: It gives rise to the bases of miraculous display.

source: དབང་པོ་རྣམས་སྦེད་པའོ། །
en: It guards the strengths.

source: སྟོབས་རྣམས་ཀྱིས་མི་རྫི་བའོ། །
en: Due to its powers, it cannot be suppressed.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་རྗེས་སུ་རྟོག་པའོ། །
en: It contemplates the branches of awakening.

source: ལམ་སྟོན་པའོ། །
en: It shows the path.

source: ཞི་གནས་ཞི་བར་བྱེད་པའོ། །
en: It brings the peace of tranquility.

source: ལྷག་མཐོང་རིག་པར་བྱེད་པའོ། །
en: It knows special insight.

source: རབ་རིབ་མེད་པའི་ཕྱིར་སྣང་བར་བྱེད་པའོ། །
en: It illumines because it is free from obscuration.

source: ཆོས་ཀྱི་སྣང་བས་མུན་པ་སེལ་བའོ། །
en: With the light of Dharma it dispels darkness.

source: རྡུལ་དང་བྲལ་བའི་ཕྱིར་རྡུལ་མེད་པའོ། །
en: Since it is free from stains, it is immaculate.

source: བརྙས་ཐབས་དང་བྲལ་བའི་ཕྱིར་མཐོ་བར་སེམས་པ་མེད་པའོ། །
en: Since it is free from disrespect, it is devoid of arrogance.

source: ཡ་ང་བའི་ལམ་ལས་རབ་ཏུ་འདས་པའི་ཕྱིར་ཀུན་ཏུ་མཐོང་བར་བྱེད་པའོ། །
en: Since it transcends the path of fear, it produces knowledge.

source: ཕྱི་ནང་དང་བྲལ་བའི་ཕྱིར་ཡུལ་མེད་པའོ། །
en: Since it transcends inside and outside, it is devoid of object.

source: !ལྟ་བས་བྱས་པ་མེད་པའི་ཕྱིར་སྟོང་པ་སྒྲོལ་བའོ། །
en: Since it is devoid of the formulation of views, it is liberating emptiness.

source: རྣམ་པར་རྟོག་པ་ཉེ་བར་ཞི་བའི་ཕྱིར། མཚན་མ་མེད་པས་རབ་ཏུ་ཕྱེ་བའོ། །
en: Since it pacifies conceptuality, it is characterized by the absence of marks.

source: ཁམས་གསུམ་པ་ལས་རྣམ་པར་འདས་པའི་ཕྱིར་སྨོན་པ་མེད་པའི་མཚན་ཉིད་དོ། །
en: Since it transcends the three realms, it has the characteristic of the absence of wishes.

source: མཚན་ཉིད་མེད་པའི་ཕྱིར་མཚན་ཉིད་གཅིག་པའོ། །
en: Since it is devoid of characteristics, it is the single characteristic.

source: མཚུངས་པ་མེད་པའི་ཕྱིར་ནམ་མཁའི་མཚན་ཉིད་དོ། །
en: Since it is unequaled, it has the characteristic of space.

source: བདུད་ཀྱི་ལས་དང་བྲལ་བའི་ཕྱིར་གཡོ་བ་དང་རློམ་སེམས་འཇོམས་པའོ། །
en: Since it is beyond the work of Māra, it has conquered the movement of thoughts and conceptuality.

source: མི་རྟོག་པའི་སྦྱིན་པའོ། །མི་གནས་པའི་ཚུལ་ཁྲིམས་སོ། །རབ་ཏུ་མི་གནས་པའི་བཟོད་པའོ། །བླང་བ་མེད་པ་དང་དོར་བ་མེད་པའི་བརྩོན་འགྲུས་སོ། །སྒྲོ་བཏགས་པ་མེད་པའི་བསམ་གཏན་ནོ། །རྣམ་པར་རིག་བྱེད་མ་ཡིན་པའི་སྒོའོ། །
en: It is nonconceptual generosity, nonabiding discipline, nondwelling patience, diligence beyond acceptance and rejection, concentration free from imputation, and the gateway to the imperceptible.

source: ཐམས་ཅད་ལ་མངོན་དུ་ཕྱོགས་པའོ། །
en: It is directed toward everything.

source: ཐབས་དང་འབྲེལ་བའོ། །
en: It is skillful.

source: སེམས་ཅན་ལ་བདག་མེད་པར་ཡང་དག་པར་གཞོལ་བའོ། །
en: It is fully committed to the selflessness of all beings.

source: དགེ་བའི་རྩ་བ་བསགས་པའོ། །
en: It accumulates roots of virtue.

source: བྱ་བ་མེད་པའོ། །བྱ་བ་དང་བྲལ་བ་སྟེ།
en: It is beyond deeds and free from activity.

source: མིའམ་ཅིའི་བདག་པོ་འདི་ནི་ཤེས་རབ་རིན་པོ་ཆེའོ། །
en: “Lord of the kiṃnaras, this is the precious insight.

source: ཤེས་རབ་རིན་པོ་ཆེ་འདི་ནི་དཀོན་མཆོག་འབྱུང་གནས་ཏིང་ངེ་འཛིན་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔས་འཐོབ་བོ། །
en: This is the precious insight achieved by the bodhisattvas who have reached the absorption of the source of wealth .

source: འདི་འཐོབ་པ་ན་རིན་པོ་ཆེ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་ཡིན་ནོ། །
en: When this insight is achieved, all wealth is subsumed within it.

source: མིའམ་ཅིའི་བདག་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་ཆུ་བོ་ཐམས་ཅད་ཀྱི་སྒོ་ནི་རྒྱ་མཚོ་ཆེན་པོ་སྟེ།
en: For example, lord of the kiṃnaras, the great ocean is the gateway for all rivers and

source: རིན་པོ་ཆེ་ཐམས་ཅད་སོགས་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་སྟེ། དེ་ལས་རིན་པོ་ཆེ་ཐམས་ཅད་འབྱུང་ངོ་། །
en: it contains and gathers all jewels; it is the source of all of them.

source: མིའམ་ཅིའི་བདག་པོ་དེ་བཞིན་དུ་དཀོན་མཆོག་འབྱུང་གནས་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྒོ་ཡིན་ཏེ།
en: Similarly, lord of the kiṃnaras, the bodhisattvas who attain this absorption of the source of wealth become the gateways for all wealth;

source: ཆོས་དཀོན་མཆོག་ཐམས་ཅད་སོགས་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བའོ། །
en: they contain the entire Dharma Jewel and subsume all other wealth.

source: དཀོན་མཆོག་འབྱུང་གནས་ཏིང་ངེ་འཛིན་ལས་དཀོན་མཆོག་གསུམ་འབྱུང་སྟེ། སངས་རྒྱས་དཀོན་མཆོག་དང་། ཆོས་དཀོན་མཆོག་དང་། དགེ་འདུན་དཀོན་མཆོག་གོ། །
en: The Three Jewels—the Buddha Jewel, the Dharma Jewel, and the Saṅgha Jewel—originate from that absorption of the source of wealth .

source: དེས་ན་དཀོན་མཆོག་འབྱུང་གནས་ཏིང་ངེ་འཛིན་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་སོགས་པ་ཞེས་བྱའོ། །
en: It is therefore said that the absorption of the source of wealth contains all wealth.”

source: བཅོམ་ལྡན་འདས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདིས་དཀོན་མཆོག་འབྱུང་གནས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པ་ལགས་སམ།
en: “Blessed One, has the kiṃnara king Druma achieved this absorption of the source of jewels ?”

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་དྲིས་ཤིག་དང་དེས་ཁྱོད་ལ་སྟོན་པར་འགྱུར་རོ། །
en: “Noble son,” “you should ask the kiṃnara king Druma and he will tell you.”

source: མིའམ་ཅིའི་བདག་པོ་ཁྱོད་ཀྱིས་དཀོན་མཆོག་འབྱུང་གནས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་བམ།
en: “Lord of the kiṃnaras, have you achieved this absorption of the source of jewels ?”

source: རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་འདི་ནི་ཐོབ་པའམ། དམིགས་པར་སོ་སོར་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ། །ཏིང་ངེ་འཛིན་འདི་ནི་སུས་ཀྱང་མི་ཐོབ་བོ། །
en: “Noble son, this absorption does not concern something that can be attained or apprehended. It cannot be attained by anyone.

source: ཏིང་ངེ་འཛིན་འདི་ནི་གཟུགས་སུ་བགྲང་བའམ། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་བགྲང་བ་མ་ཡིན་ནོ། །
en: This absorption cannot be categorized as form, feeling, perception, formation, or consciousness.

source: ཏིང་ངེ་འཛིན་འདི་ནི་གཟུགས་སུ་སྣང་བ་མ་ཡིན་ནོ། །
en: This absorption does not have a physical form.

source: ཏིང་ངེ་འཛིན་འདི་ནི་མིག་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་གཟུང་བ་མ་ཡིན།
en: This absorption cannot be apprehended by the eye, the ear, the nose, the tongue, the body, or the mind.

source: སྐྱེ་བའི་མཚན་ཉིད་མ་ཡིན།
en: It does not have the characteristics of arising, [ceasing, and enduring.]

source: འཇིག་པའི་མཚན་ཉིད་མ་ཡིན།
en: It does not have the characteristics of [arising, ]ceasing, and [enduring.]

source: གནས་པའི་མཚན་ཉིད་མ་ཡིན།
en: It does not have the characteristics of [arising, ceasing, and ]enduring.

source: རྒྱུན་འཆད་པའི་མཚན་ཉིད་མ་ཡིན།
en: It does not have the characteristic of being interrupted.

source: མཚན་ཉིད་གཅིག་པ་མ་ཡིན། མཚན་ཉིད་ཐ་དད་པ་མ་ཡིན།
en: It does not have a singular characteristic or several characteristics.

source: མཚན་ཉིད་མ་ཡིན། མཚན་ཉིད་དང་བྲལ་བ་མ་ཡིན། མཚན་ཉིད་མེད་པ་ཡང་མ་ཡིན་ཏེ།
en: It is not characterized or noncharacterized, but neither is it beyond characteristics.

source: བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: It is inexpressible.

source: ཏིང་ངེ་འཛིན་འདི་ནི་ཡོངས་སུ་རྟོགས་པར་མི་ནུས་ཏེ། ཀུན་ཏུ་རྟོགས་པར་མ་ཡིན་རྣམ་པར་རྟོགས་པར་མ་ཡིན་ནོ། །
en: This absorption cannot be understood, realized, or comprehended.

source: གལ་ཏེ་ཏིང་ངེ་འཛིན་འདི་ཡོངས་སུ་རྟོགས་པའམ། ཀུན་ཏུ་རྟོགས་པའམ། རྣམ་པར་རྟོགས་པར་གྱུར་ན་ནི་བརྟག་པའི་གཞི་ཉིད་དུ་འགྱུར་གྱི་ཏིང་ངེ་འཛིན་མ་ཡིན་ནོ། །
en: Because, if this absorption was understood, realized, or comprehended, it would become a basis of investigation and it would not be an absorption.

source: རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དོ། །
en: “Noble son, absorption refers to the sameness of all phenomena.

source: ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་དང་ང་མཉམ་མོ། །དེ་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱང་མཉམ་མོ། །
en: The sameness of all phenomena is the same with respect to myself and all beings.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཏིང་ངེ་འཛིན་འདི་དང་སེམས་ཅན་ཐམས་ཅད་མཉམ་མོ། །
en: Therefore, noble son, this absorption and all beings are the same.

source: སེམས་ཅན་ཐམས་ཅད་ནི་སྟོང་པ་སྟེ།
en: Because all sentient beings are empty, and

source: སྟོང་པའི་མཚན་ཉིད་ནི་ཏིང་ངེ་འཛིན་འདིའོ། །
en: this absorption has the characteristic of emptiness;

source: སེམས་ཅན་ཐམས་ཅད་ནི་མཚན་ཉིད་མེད་པ་སྟེ།
en: all sentient beings are without marks, and

source: མཚན་ཉིད་མེད་པའི་མཚན་ཉིད་ནི་ཏིང་ངེ་འཛིན་འདིའོ། །
en: this absorption has the characteristic of the absence of marks;

source: སེམས་ཅན་ཐམས་ཅད་ནི་སྨོན་པ་མེད་པ་སྟེ།
en: all sentient beings are without wishes, and

source: སྨོན་པ་མེད་པའི་མཚན་ཉིད་ནི་ཏིང་ངེ་འཛིན་འདིའོ། །
en: this absorption has the characteristic of the absence of wishes;

source: སེམས་ཅན་ཐམས་ཅད་ནི་དབེན་པ་སྟེ།
en: all sentient beings are disengaged, and

source: དབེན་པའི་མཚན་ཉིད་ནི་ཏིང་ངེ་འཛིན་འདིའོ། །
en: this absorption has the characteristic of disengagement;

source: སེམས་ཅན་ཐམས་ཅད་ནི་བདག་མེད་པ་སྟེ།
en: all sentient beings are selfless, and

source: བདག་མེད་པའི་མཚན་ཉིད་ནི་ཏིང་ངེ་འཛིན་འདིའོ། །
en: this absorption has the characteristic of selflessness.

source: དེ་ནི་ལུས་དང་ངག་དང་སེམས་ཀྱིས་རེག་པར་མི་ནུས་སོ། །
en: It cannot be reached through body, speech, or mind.

source: གང་ལ་ལ་དག་ཆོས་ལ་རེག་པར་བྱེད་པ་དང་། མཉམ་པར་བྱེད་པ་དང་། མངོན་པར་མཉམ་པར་བྱེད་པ་དེ་དག་ཐམས་ཅད་ནི་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་ང་རྒྱལ་ཅན་དུ་བསྟན་ཏོ། །
en: It is taught in the well-spoken Dharma-Vinaya that those who seek to reach, connect, and unite with the Dharma are proud.”

source: བཅོམ་ལྡན་འདས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་སྤྱོད་པ་བག་མཆིས་པ་འདི་ལྟ་བུ་དང་། ཆོས་ལ་སྤོབས་པ་འདི་ལྟ་བུ་ནི་ངོ་མཚར་ཏོ། །
en: “Blessed One, the careful conduct of the kiṃnara king Druma and his eloquence concerning the Dharma are amazing!”

source: རིགས་ཀྱི་བུ་བྱ་བ་ཐམས་ཅད་ཀྱང་ཀུན་ཏུ་སྟོན་ལ་བྱ་བ་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་གོས་པ་འདི་ནི་ཐབས་དང་ཤེས་རབ་ལས་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སའོ། །
en: “Noble son,” “this way of displaying all activities while not being tainted by any of them is the level of bodhisattvas who are adept in skill and insight.

source: རིགས་ཀྱི་བུ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདིས་རྒྱུད་ཀྱི་སྒྲ་དང་། གླུའི་སྒྲ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་བྱས་པའི་ཚུལ་འདིས་མིའམ་ཅི་བྱེ་བ་ཕྲག་བདུན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །དྲི་ཟ་བྱེ་བ་ཕྲག་སུམ་ཅུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །ལྟོ་འཕྱེ་ཆེན་པོ་བྱེ་བ་ཕྲག་བཞི་བཅུ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Noble son, through the tunes of his lute, and through the songs, instruments, and drums, the kiṃnara king Druma has ripened seventy million kiṃnaras toward unsurpassed and perfect awakening, along with three hundred million gandharvas and four hundred million mahoragas.

source: རང་གི་འཁོར་གྱི་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: He has also ripened eighty-four thousand beings from his own retinue toward awakening.

source: ཤེས་རབ་དང་ཐབས་ཀྱི་ཡེ་ཤེས་འདི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་དང་གང་གི་ཚེ་འཁོར་གྱི་ཆེ་བ་ཉིད་ཐོབ་པ་དེ་དང་དེའི་ཚེ། སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: Whenever bodhisattvas who possess such wisdom of insight and skill have a following of some magnitude, countless beings are ripened.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱུ་མེད་པར་མེ་མི་འབར་རོ། །
en: Noble son, a fire cannot blaze without kindling.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དབེན་པ་ན་གནས་པ་ཡང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་མི་འབར་རོ། །
en: Likewise, when bodhisattva great beings remain in solitude, the ripening of beings cannot blaze.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱུ་ཡོད་ན་མེ་འབར་རོ། །
en: Noble son, a fire blazes when it is fueled by substances to burn.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་ནང་ན་འདུག་ན། སེམས་ཅན་ཡོངས་སུ་སྦྱིན་པར་བྱ་བ་འབར་རོ། །
en: Likewise, when bodhisattva great beings reside among ordinary beings, the ripening of those beings will blaze.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་རྣམ་གྲངས་འདིས་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟ་ཇི་ལྟ་བུར་ཡུལ་དང་འཁོར་ཆེན་པོ་འབྱོར་པར་གྱུར་པ། དེ་ལྟ་དེ་ལྟ་བུར་སེམས་ཅན་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་རིག་པར་བྱའོ། །
en: Noble son, through this analogy, you should understand that bodhisattvas ripen countless beings in proportion to the magnitude of the territory and the following they command.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the Blessed One had said those words, the bodhisattva Divyamauli asked him,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་རྒྱུད་ཀྱི་སྒྲ་དང་། གླུའི་སྒྲ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་བགྱིས་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད།
en: “Blessed One, how does the kiṃnara king Druma ripen beings through the tunes of those lutes, songs, instruments, and drums?”

source: རིགས་ཀྱི་བུ་མིའམ་ཅི་དང་། དྲི་ཟ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གླུ་དང་། རོལ་མོའི་དབྱངས་སྒྲ་ལ་མོས་པ་རྣམས་ལ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་གང་གི་ཚེ་པི་བང་གི་སྒྲ་ཐོས་པར་བྱེད་ཅིང་སིལ་སྙན་དང་། གླུ་དབྱངས་སྦྱོར་བ་དེ་ན་མིའམ་ཅི་དང་། དྲི་ཟ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དེ་དག་དགའ་བ་དང་། རབ་ཏུ་མགུ་བ་ཆེན་པོ་འཐོབ་བོ། །
en: “Noble son,” “when the kiṃnara king Druma plays his lute, accompanied by music and song, to the kiṃnaras, gandharvas, mahoragas, and those who are inspired by the sound of music, those kiṃnaras, gandharvas, and mahoragas become delighted and thrilled.
